{"config": [{"config": {"strides": [1, 1], "batch_input_shape": [null, 50, 50, 3], "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "filters": 32, "activation": "relu", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_3"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "padding": "valid", "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "filters": 32, "activation": "relu", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_4"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "bias_regularizer": null, "units": 128, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"use_bias": true, "bias_regularizer": null, "units": 1, "kernel_constraint": null, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "name": "dense_4"}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.2.0", "class_name": "Sequential"}